#Задание 2.1

name1 = input('Введите имя:')
name2 = input('Введите фамилию:')
age = int(input('Введите возраст:'))


print(name1, name2, age)