# Задание 1.1

name1 = input('Введите имя:')
name2 = input('Введите фамилию:')
age = int(input('Введите возраст:'))

information = (f"  имя: {name1}, фамилия: {name2}, возраст: {age}")

print(information)
